{
    "id": "pupa",
    "backgroundUrl": "https://eknmhub1.s3.eu-central-1.amazonaws.com/articles/pupa/bg.jpg",
    "logoUrl": "https://eknmhub1.s3.eu-central-1.amazonaws.com/articles/pupa/logo_rev.png",
    "content": [
     {
      "index": 1,
      "ref": "",
      "text": "Вселенная в тоннеле одновременно похожа и непохожа на множество других вселенных, включая нашу реальную. В ней как игровые, так и неигровые персонажи имеют свою собственную историю, характер, характеристики, внешний вид, знания и умения. Среди всех разнообразных форм жизни этого мира, лишь некоторые достойны называться разумными и именно этих рас может быть ваш персонаж.",
      "type": "text"
     },
     {
      "index": 2,
      "ref": "",
      "text": "Ващ персонаж может быть человеком, литоидом, дендроидом, фунгоидом, зверолюдом, спектралом, элементалем или роевиком",
      "type": "citation"
     },
     {
      "index": 3,
      "ref": "",
      "text": "Помимо расы вашему персонажу надо будет выбрать особенности, среди которых есть расовые, религиозные и недостатки; одну из более 50 предысторий; навыки; а также школы магии и/или стили боя. С такими обширными возможностями кастомизации вы сможете создать как умного и таинственного мага, так и смелого харизматичного воина, так и любой другой образ из вашего сознания, даже за рамками классических РПГ типажей.",
      "type": "text"
     },
     {
      "index": 4,
      "ref": "",
      "text": "Вам доступны школы магии органики, псионики, призыва, геометрии и 4 ветки элементальной магии. А также 5 различных стилей боя с вариациями развития",
      "type": "citation"
     },
     {
      "index": 5,
      "ref": "",
      "text": "Поскольку мир ПУПы находится в технологическом развитии, схожем с нашей эпохой возрождения, помимо классического и экзотического холодного оружия, у вас будет возможность пользоваться арбалетами, мушкетами и другими механическими приспособлениями. Города заметно больше и сложнее, чем в средневековье, наука развивается, хоть и своим особым путем. Значительная часть этого невероятного мира уже доступна для игры:",
      "type": "text"
     },
     {
      "index": 6,
      "ref": "",
      "text": "<li>Более 60 вариантов оружия разных материалов и назначений</li>        <li>Более 35 артефактов разной степени редкости и могущественности</li>        <li>Продуманная система алхимии, ингрединетов и рецептов</li>        <li>18 накладываемых эффектов, в том числе бурный оргазм</li>        <li>СПИД, Проказа и ПТСР</li>",
      "type": "formatted"
     },
     {
      "index": 7,
      "ref": "https://eknmhub1.s3.eu-central-1.amazonaws.com/articles/pupa/pupa+0.3.pdf",
      "text": "Книга игрока",
      "type": "link"
     }
    ],
    "name": "",
    "section": "projects"
   }