import { Injectable } from '@angular/core';
import { Article, Binding, ParagraphType } from './article';

@Injectable({
  providedIn: 'root',
})

export class LibraryService {

  articles: { [id: string] : Article; } = {};

  constructor() {
    this.articles['pokemon-abuse'] = { info: {
      id: 'pokemon-abuse',
      firstLine: 'Жорстокість та Насильство у світі Покемонів:',
      secondLine: 'справжня правда про всесвіт, в якому панує Стокгольмський синдром та Експлуатація',
      imgUrl: '../../../assets/library/pokemon_abuse/sadpikachu_2.png',
      author: 'EKNM',
    }, content: [
      {
        type: ParagraphType.Text,
        text: "",
        link: "../../../assets/library/pokemon_abuse/sadpikachu.png"
      },
      {
        type: ParagraphType.Text,
        text: "Всім нам відомий цей милий і барвистий світ Покемонов, але все не так яскраво як здається. Цей світ давно потонув у ненаситності та жадібності страшних чудовиськ, і я зараз говорю не про таких монстрів як Gengar, Gyarados або Mewtwo, я говорю про людей. Здавалося б, люди та дивні звірята живуть у світі, веселяться, дружать і проводять час разом, але насправді це суспільство століттями експлуатує цих нещасних та милих монстриків. Це суспільство настільки довго живе і жорстоко поневолює покемонів, що всі давно вважають це нормою.",
        link: ""
      },
      {
        type: ParagraphType.Text,
        text: "Погляньмо на цей світ по-іншому. Люди навчилися приручати Покемонов навіть до насильницького ув'язнення їх за допомогою технологій та подальшого використання в особистих цілях, ці технології називаються покеболами і вони є досить поширеними. З одного боку може здатися, що все ж таки відносини між цими істотами і так званим \"тренером\" швидше дружні, але це не зовсім так. Цілі упіймання цих істот бувають різні, починаючи від банального бажання появи вихованця, закінчуючи використанням їх для якихось виробничих цілей, наприклад: деякі істоти вміють керувати електрикою і їх використовують у різних цілях для живлення різних електричних приладів, установок і т.п. Ви тільки уявіть: бідні звірята у вигляді гвинтиків і магнітиків Magnemit-и змушені батрачити на заводах за БЕЗКОШТОВНО замість того, щоб цим займалися чоловіки або хоча б електрички (прим. фемінітив від слова електрик)",
        link: "../../../assets/library/pokemon_abuse/magnemite.jpg"
      },
      {
        type: ParagraphType.Text,
        text: "Окремо варто відзначити культуру змагань та турнірів у цьому світі. Багато людей ловлять цих покемонів з метою приручення вихованця або з метою перемогти на змаганнях з ними. Цьому вчать дітей ще з раннього віку, практично будь-який школяр мріє отримати свій перший покебол, щоб насильно зловити якогось невинного Charmander-а. Багато дітей мріють вирости, зловити собі команду покемонів і піти на бої на стадіонах, борючись своїми звірятами один з одним, адже вони не просто дряпаються - вони дихають вогнем, закликають грозу, створюють каменепади і це тільки вершина айсберга того, на що здатні Покемони. Ви тільки можете собі це уявити, що б у нашому світі люди, господарі своїх звірів, збиралися на стадіонах і билися на собаках просто так, щоб дізнатися хто переможе Такса або Кане-Корсо. Це якими нелюдами треба бути, щоб своїх \"друзів\" і \"вихованців\" вести на такі муки. І ці турніри, де день і ніч діти борються між собою заради якихось дрібничок просто щоб задовольнити свій егоїзм і жагу до самореалізації, є всесвітньо обожнюваними, тисячі, а то й сотні тисяч людей і фанатів збираються подивитися як великий дракон буде битися на смерть з електричним щуром.",
        link: ""
      },
      {
        type: ParagraphType.Text,
        text: "А найжахливіше, що всі ці види спілкування зі своїм вихованцем, другом, партнером вважається нормою і подається як обопільне бажання з обох сторін. Усім чудово відомо, що кожен покемон унікальний і має свій індивідуальний характер і приклад цього послужить найвідоміший персонаж - Пікачу, який незважаючи ні на що і ні за яких обставин не хоче залазити в покебол. Глядачам намагаються показати, що тренера намагаються побудувати між ними та своїми спійманими вихованцями дружні стосунки, але тоді стає незрозумілим зміст тих покеболів, за фактом люди насильно ловлять і використовують можливості цих істот, хоча тих же цілей можна досягти аналогічним шляхом не ловлячи у покебол, а намагаючись просто приручити. Тим самим виходить, що ніби відносини заздалегідь будуються на насильницькому прирученні шляхом можливості в будь-який момент обмежити свободу істоти, що б у подальшому мати можливість використовувати по необхідності для власних цілей, будь то бажання спілкування та набуття друга, перемога в турнірах або використання у виробничих цілях. Можливо, дійсно більшості покемонів подобається бути заточеними в маленькі кульки розміром зі сливу, але в такому разі я не можу знайти жодного іншого пояснення, крім того, що у всіх покемонів за довгі роки експлуатації виробився Стокгольмський синдром.",
        link: "../../../assets/library/pokemon_abuse/stadion.jpg"
      },
      {
        type: ParagraphType.Text,
        text: "Можливо, прочитавши цю невелику статтю, ви по-іншому подивіться на світ покемонів, а краще на наш світ і на наше ставлення до наших реальних вихованців. Бережіть і любіть наших братів-менших і все ж таки спробуємо допомогти бідним звіркам з надздібностями здобути хоч крапельку свободи і прав, шляхом просування тега #СвободуПокемонамEKNM у своїх соцмережах.",
        link: ""
      },
    ] };
  }

  getPublicBindings() {
    const bindings = [] as Binding[];
    for (let key in this.articles) {
      bindings.push(this.articles[key].info);
    }
    return bindings
  }

  getArticleWithId(id: string) {
    return this.articles[id];
  }
}
  