import { Injectable } from '@angular/core';
import { Article, Binding, ParagraphType } from './article';

@Injectable({
  providedIn: 'root',
})

export class LibraryService {

  articles: { [id: string] : Article; } = {};

  constructor() {
    //TODO: get from backend
    this.addPokemonArticle();
    this.addSteamArticle();
  }

  getPublicBindings() {
    const bindings = [] as Binding[];
    for (let key in this.articles) {
      bindings.push(this.articles[key].info);
    }
    return bindings
  }

  getArticleWithId(id: string) {
    return this.articles[id];
  }

  addPokemonArticle() {
    this.articles['pokemon-abuse'] = { info: {
      id: 'pokemon-abuse',
      firstLine: 'Жорстокість та Насильство у світі Покемонів:',
      secondLine: 'справжня правда про всесвіт, в якому панує Стокгольмський синдром та Експлуатація',
      imgUrl: '../../../assets/library/pokemon_abuse/sadpikachu_2.png',
      author: 'EKNM',
    }, content: [
      {
        type: ParagraphType.Text,
        text: "",
        link: "../../../assets/library/pokemon_abuse/sadpikachu.png"
      },
      {
        type: ParagraphType.Text,
        text: "Всім нам відомий цей милий і барвистий світ Покемонов, але все не так яскраво як здається. Цей світ давно потонув у ненаситності та жадібності страшних чудовиськ, і я зараз говорю не про таких монстрів як Gengar, Gyarados або Mewtwo, я говорю про людей. Здавалося б, люди та дивні звірята живуть у світі, веселяться, дружать і проводять час разом, але насправді це суспільство століттями експлуатує цих нещасних та милих монстриків. Це суспільство настільки довго живе і жорстоко поневолює покемонів, що всі давно вважають це нормою.",
        link: ""
      },
      {
        type: ParagraphType.Text,
        text: "Погляньмо на цей світ по-іншому. Люди навчилися приручати Покемонов навіть до насильницького ув'язнення їх за допомогою технологій та подальшого використання в особистих цілях, ці технології називаються покеболами і вони є досить поширеними. З одного боку може здатися, що все ж таки відносини між цими істотами і так званим \"тренером\" швидше дружні, але це не зовсім так. Цілі упіймання цих істот бувають різні, починаючи від банального бажання появи вихованця, закінчуючи використанням їх для якихось виробничих цілей, наприклад: деякі істоти вміють керувати електрикою і їх використовують у різних цілях для живлення різних електричних приладів, установок і т.п. Ви тільки уявіть: бідні звірята у вигляді гвинтиків і магнітиків Magnemit-и змушені батрачити на заводах за БЕЗКОШТОВНО замість того, щоб цим займалися чоловіки або хоча б електрички (прим. фемінітив від слова електрик)",
        link: "../../../assets/library/pokemon_abuse/magnemite.jpg"
      },
      {
        type: ParagraphType.Text,
        text: "Окремо варто відзначити культуру змагань та турнірів у цьому світі. Багато людей ловлять цих покемонів з метою приручення вихованця або з метою перемогти на змаганнях з ними. Цьому вчать дітей ще з раннього віку, практично будь-який школяр мріє отримати свій перший покебол, щоб насильно зловити якогось невинного Charmander-а. Багато дітей мріють вирости, зловити собі команду покемонів і піти на бої на стадіонах, борючись своїми звірятами один з одним, адже вони не просто дряпаються - вони дихають вогнем, закликають грозу, створюють каменепади і це тільки вершина айсберга того, на що здатні Покемони. Ви тільки можете собі це уявити, що б у нашому світі люди, господарі своїх звірів, збиралися на стадіонах і билися на собаках просто так, щоб дізнатися хто переможе Такса або Кане-Корсо. Це якими нелюдами треба бути, щоб своїх \"друзів\" і \"вихованців\" вести на такі муки. І ці турніри, де день і ніч діти борються між собою заради якихось дрібничок просто щоб задовольнити свій егоїзм і жагу до самореалізації, є всесвітньо обожнюваними, тисячі, а то й сотні тисяч людей і фанатів збираються подивитися як великий дракон буде битися на смерть з електричним щуром.",
        link: ""
      },
      {
        type: ParagraphType.Text,
        text: "А найжахливіше, що всі ці види спілкування зі своїм вихованцем, другом, партнером вважається нормою і подається як обопільне бажання з обох сторін. Усім чудово відомо, що кожен покемон унікальний і має свій індивідуальний характер і приклад цього послужить найвідоміший персонаж - Пікачу, який незважаючи ні на що і ні за яких обставин не хоче залазити в покебол. Глядачам намагаються показати, що тренера намагаються побудувати між ними та своїми спійманими вихованцями дружні стосунки, але тоді стає незрозумілим зміст тих покеболів, за фактом люди насильно ловлять і використовують можливості цих істот, хоча тих же цілей можна досягти аналогічним шляхом не ловлячи у покебол, а намагаючись просто приручити. Тим самим виходить, що ніби відносини заздалегідь будуються на насильницькому прирученні шляхом можливості в будь-який момент обмежити свободу істоти, що б у подальшому мати можливість використовувати по необхідності для власних цілей, будь то бажання спілкування та набуття друга, перемога в турнірах або використання у виробничих цілях. Можливо, дійсно більшості покемонів подобається бути заточеними в маленькі кульки розміром зі сливу, але в такому разі я не можу знайти жодного іншого пояснення, крім того, що у всіх покемонів за довгі роки експлуатації виробився Стокгольмський синдром.",
        link: "../../../assets/library/pokemon_abuse/stadion.jpg"
      },
      {
        type: ParagraphType.Text,
        text: "Можливо, прочитавши цю невелику статтю, ви по-іншому подивіться на світ покемонів, а краще на наш світ і на наше ставлення до наших реальних вихованців. Бережіть і любіть наших братів-менших і все ж таки спробуємо допомогти бідним звіркам з надздібностями здобути хоч крапельку свободи і прав, шляхом просування тега #СвободуПокемонамEKNM у своїх соцмережах.",
        link: ""
      },
    ] };
  }

  addSteamArticle() {
    this.articles['steam_engine_comeback'] = { info: {
      id: 'steam_engine_comeback',
      firstLine: 'Паровые двигатели как вершина человеческой эволюции',
      secondLine: 'или почему пришло время затерянных в истории технологий',
      imgUrl: '../../../assets/library/steam_engine_comeback/back1.png',
      author: 'EKNM',
    }, content: [
      {
        type: ParagraphType.Text,
        text: "В современном мире технологий и корпораций мы начинаем забывать, в какую сторону должно двигаться человечество. Все эти смартфоны, электромобили, платные подписки на Нетфликс ведут человечество в пропасть потребления и отсутствия наслаждения жизнью. А может, все это заговор?",
        link: ""
      },
      {
        type: ParagraphType.Text,
        text: "Для того, чтобы так думать, есть как минимум несколько причин. Как мы видим, сейчас появился глобальный дефицит горючего топлива, отказ от дизельных двигателей и переход на электромобили. Но разве это не очередная попытка навязать свое мнение нефтяных компаний по своему видению мира Вам, чтобы Вы думали, что вы переходите на новый этап эволюции человека, экологически чистый, но существующий от розетки до розетки? Ведь на самом деле под экологически чистой обложкой электромобилей стоит точно такой же дизельный генератор, который производит электроэнергию и дизельные грузовики, которые перевозят аккумуляторы для машин. Все это не только заставляет не отказываться от горючего топлива, а наоборот, повышает его спрос в промышленной сфере.",
        link: "../../../assets/library/steam_engine_comeback/img1.png"
      },
      {
        type: ParagraphType.Text,
        text: "Даже сейчас навязывание мыслей о переходе на электричество преследует Вас, когда вы приезжаете на заправку и видите цены на заправку обычного автомобиля, которые являются в 10, а то и 20 раз выше, чем цены зарядки электромобилей. Вы, наверное, подумаете после этого купить электромобиль, но что в этом прекрасного? Почему все забывают о других видах добычи энергии, по которому есть целое направление в искусстве, которое просто заставляет восхищаться своим внешним видом?",
        link: ""
      },
      {
        type: ParagraphType.Text,
        text: "Да-да, Вы все правильно поняли. Речь пойдет о паровых двигателях. Возможно, вы знаете, что в первой четверти XX века автомобили с паровой машиной и электромобили получили широкое распространение. В 1900 году примерно половина автомобилей в США была на паровом ходу. Паровые, электрические и бензиновые автомобили конкурировали десятилетия, пока в 1910-х бензиновые двигатели внутреннего сгорания не стали доминирующими. Возможно, все это чей-то заговор и автомобилестроение пошло не в ту сторону?",
        link: "../../../assets/library/steam_engine_comeback/img2.png"
      },
      {
        type: ParagraphType.Text,
        text: "Вы только посмотрите, как эстетично выглядит автомобиль на паровой тяге, который был разработан еще в конце XIX века. Эти линии, каток спереди, даже сейчас такой автомобиль привлекал бы много взглядов и на нем было бы не стыдно поехать в самый роскошный ресторан.",
        link: ""
      },
      {
        type: ParagraphType.Text,
        text: "",
        link: "../../../assets/library/steam_engine_comeback/img6.png"
      },
      {
        type: ParagraphType.Text,
        text: "Хорошо, конечно, вспоминать о том, что мы когда-то упустили, но сейчас мы имеем то, что имеем. И в этой ситуации мы может только гнуть свою линию для максимального распространения паровых двигателей и перехода на паровую тягу. Начать можно с себя, переоборудовав свой обычный автомобиль на горючем топливе в паровой. Как, спросите Вы? А очень просто: хоть эту технологию и пытались скрывать от нас годами, достаточно простого советского… Газогенератора. Да, вы, наверное, скажете, что это не совсем и паровой двигатель, но идея похожа. Переоборудование стоит до 100 долларов, а экономия на топливе в разы.",
        link: ""
      },
      {
        type: ParagraphType.Text,
        text: "Конечно, приведенный сверху вариант не совсем может удовлетворять истинного поклонника стимпанка, поэтому мы предложим и другой вариант: сборка полностью самостоятельного парового двигателя для автомобиля. У такого варианта есть огромная масса преимуществ: вы можете пользоваться любым «топливом», которое попадется вам под руку, от дров до коровьих кизяков, простая и соответственно ресурная конструкция, бесшумность и экологичность (это особый аргумент для тех, кто покупает электромобили для экологии, учитывая что при создании батарей для них происходят вредные выбросы в атмосферу). Ниже приведена схема работы полноценного парового двигателя.",
        link: "../../../assets/library/steam_engine_comeback/img3.png"
      },
      {
        type: ParagraphType.Text,
        text: "",
        link: "../../../assets/library/steam_engine_comeback/img4.png"
      },
      {
        type: ParagraphType.Text,
        text: "Да и к тому же, посмотрите, как прекрасно выглядят паровозы, которые были созданы в начале ХХ века. Это идеальная гармония металла, угля и пара. Благодаря этому возникло целое направление, которое показывает, насколько были бы прекрасны все механизмы, созданные при помощи паровой энергии. А что у нас вместо этого? Правильно, ниссан лиф и другие машины, похоже на рыбу-каплю.",
        link: "../../../assets/library/steam_engine_comeback/img5.png"
      },
      {
        type: ParagraphType.Text,
        text: "Как заключение, стоит сказать о том, что нужно начинать популяризировать паровые двигатели, поскольку это является крайне перспективным, эстетичным и экологичным видом двигателя. Если мы не начнем сейчас двигаться к стимпанку, то когда? Главное – это начать.",
        link: ""
      },
    ] };
  }
}
  