{
    "home": {
        "projects": "Цех",
        "articles": "Библиотека",
        "beer": "Пивоварня",
        "entertainment": "Игровая",
        "warehouse": "Склад",
        "info": "Информационная доска"
    },

    "brew": {
        "description": "Начиная с лета 2021 года, мы занимаемся варкой крафтового пива в формате маленьких экспериментальных партий. В будущем планируется повторение удачных рецептов и проработка новых рецептур. Варка нашего пива проходит при соблюдении всех возможных технологий, но вручную и на даче.",
        "technology": "В экспериментальном режиме каждая партия изготавливается тиражом около 20 бутылок объема 0.5 литра и фасуется по бутылкам с уникальной наклейкой.",
        "order": "На время войны изготовление приостановлено",
        "sorts": "Сорты"
    },

    "projects":{
        "scp_text": "Глобальная стратегия в реальном времени, игрок управляет Фондом SCP от лица Основателя",
        "scp_description": "[ДАННЫЕ УДАЛЕНЫ]",
        "bottleshelf_text": "Система контроля и управления баром, коктейлями и ингридиентами",
        "bottleshelf_description": "Данная система разработана в основном для перспективного проекта бара-казино, которое в перспективе должно существовать и иметь в своем ассортименте уникальные коктейли, разработанные EKNM и пиво собственной варки.",
        "pupa_text": "Авторская система для ролевых настольных игр",
        "pupa_description": "Добро пожаловать в мир, образовавшийся в незапамятные времена на внутреней поверхности тоннеля в ухе панка! В нем вы можете создать своего уникального персонажа с различными характеристиками и особенностями. Пользуйтесь магией, стилями боя, разнообразным оружием и мощными артефактами."
    },

    "games": {
        "server_name": "Название сервера:",
        "server_ip": "Адрес сервера:",
        "server_version": "Версия сервера:",
        "server_mode": "Мод сервера:",
        "server_status": "Статус сервера:",
        "server_ok": "Сервер работает",
        "server_error": "Сервер недоступен"
    },

    "info": {
        "public_resources": "ПУБЛИЧНЫЕ РЕСУРСЫ",
        "feedback": "ОБРАТНАЯ СВЯЗЬ",
        "about": "О НАС",
        "question1": "- Что такое EKNM?",
        "answer1": "Организация, компания, секта, бренд, корпорация, синдикат, колыбельная, просто набор букв. Выберите то, что вам больше нравится.",
        "question2": "- В чем цель EKNM?",
        "answer2": "Создание и поддержка инициатив, проектов и разработок в сфере науки, творчества и бизнеса. Возможно что-то ещё.",
        "question3": "- А зачем?",
        "answer3": "Время одиночной работы прошло и такой подход безнадёжно устарел. Совместная работа более эффективна и позволяет задействовать больше знаний, ресурсов и разносторонних взглядов. Мы живём в эру заводов.",
        "question4": "- Как помочь или присоединиться?",
        "answer4": "Обратиться по контактам на этой странице и описать что вы можете предложить или чем мы вам можем помочь. В идеале вы должны лично знать кого-то из нас, но это не обязательно.",
        "question5": "- В чем EKNM заинтересован на данный момент?",
        "answer5": "Разработки, статьи и проекты любого типа, которые содержат в себе что-то инновационное и/или творческую ценность. Более четкие рамки не имеют смысла."
    },

    "library": {
        "article": "СТАТЬИ",
        "read": "ЧИТАТЬ"
    },

    "pokemon_article":
    {
        "header_1": "Жестокость и Насилие в мире Покемонов:",
        "header_2": "настоящая правда про вселленную, в которой царит Стокгольмский синдром и Эксплуатация",
        "paragraph_1": "Всем нам известен этот милый и красочный мир Покемонов, но  все не так красочно как кажется. Этот мир давно утонул в ненасытности и жадности страшных чудовищ, и я сейчас говорю не о таких монстрах как Gengar, Gyarados или Mewtwo, я говорю о людях. Казалось бы, люди и чудные зверьки живут в мире, веселяться, дружат и проводят время вместе, но на деле это общество веками эксплуатирует этих несчастных и милых монстриков. Это общество настолько долго живет и жестоко порабощает покемонов, что все давно считают это нормой.",
        "paragraph_2": "Давайте взглянем на этот мир по-другому. Люди научились приручать Покемонов даже вплоть до насильного заточения их с помощью технологий и дальнейшего использования в личных целях, эти технологии называются покеболлы и они достаточно распространенны. С одной стороны может показаться, что все же отношения между этими существами и так называемым “тренером” скорее более дружественные, но это не совсем так. Цели поимки этих существ бывают разные, начиная от банального желания появления питомца, заканчивая использованием их для каких-то производственных целей, так например: некоторые существа умеют управлять электричеством и их используют в различных целях для питания различных электрических приборов, установок и т.п. Вы только представьте: бедные зверьки в виде винтиков и магнитиков Magnemit-ы вынужденны батрачить на заводах за БЕСПЛАТНО вместо того, что бы этим занимались мужчины или хотя бы электрички(прим. феминитив от слова электрик)",
        "paragraph_3": "Отдельно стоить отметить культуру соревнований и турниров в этом мире. Множество людей ловят этих покемонов с целью приручения питомца или с целью победить на соревнованиях с ними. Этому  учат детей еще с раннего возраста, практически любой школьник мечтает получить свой первый покебол, что бы насильно поймать какого-нибудь безобидного Charmander-а. Многие дети мечтают вырасти, поймать себе команду покемонов и пойти на бои на стадионах, сражаясь своими зверьками друг с другом, а ведь они не просто царапаются - они дышат огнем, призывают грозу, создают камнепады и это только вершина айсберга того, на что способны Покемоны. Вы только можете себе это представить что бы в нашем мире люди, хозяева своих зверей, собирались на стадионах и сражались на собаках просто так, что бы узнать кто победит Такса или Кане-Корсо. Это какими извергами надо быть, что бы своих \"друзей\" и \"питомцев\" вести на такие муки. И эти турниры, где день и ночь дети сражаются между сабой ради каких-то безделушек просто что бы удовлетворить свой эгоизм и жажду самореализации, являются всемирно обожаемыми, тысячи, а то и сотни тысяч людей и фанатов собираются посмотреть как большой огнедышащий дракон будет биться насмерть с электрической крысой.",
        "paragraph_4": "А самое ужасное, что все эти виды \"общения\" со своим питомцем, другом, партнером считается нормой и подается как обоюдное желание с обеих сторон. Всем прекрасно известно, что каждый покемон уникален и обладает своим индивидуальным характером и примером этому послужит самый известный персонаж - Пикачу, который несмотря ни на что и ни при каких обстоятельствах не хочет залезать в покеболл. Зрителям пытаются показать, что тренера стараются построить между ними и своими пойманными питомцами дружественные отношения, но тогда становится непонятен смысл тех покеболлов, по факту люди насильно ловят и используют возможности этих существ, хотя тех же целей можно достичь аналогичным путем не ловя в покеболл, а пытаясь просто приручить. Тем самым получается, что как бы отношения заранее строятся на насильном приручении путем возможности в любой момент ограничить свободу существа, что бы в последующем иметь возможность использовать по необходимости для собственных целей, будь то желание общения и обретения друга, победа в турнирах или  использование в производственных целях. Возможно действительно большинству покемонов нравится быть заточенными в маленькие шарики размером со сливу, но в таком случае я не могу найти никакого другого обьяснения, кроме как того, что у всех покемонов за время долгих лет эксплуатации выработался Стокгольмский синдром.",
        "paragraph_5": "Возможно, прочитав эту небольшую статью, вы по-другому посмотрите на мир покемонов, а лучше и на наш мир и на наше отношения к нашим реальным питомцам. Берегите и любите наших братьев-меньших и все же давайте попробуем помочь бедным зверькам со сверхспособностями обрести хоть капельку свободы и прав, путем продвижение тега #СвободуПокемонамEKNM в своих соцсетях."
    },

    "placeholder":
    {
        "example": "Нехуй шастать!"
    },

    "project_preview":
    {
        "condition": "Статус",
        "description": "Описание",
        "page": "Страница"
    },

    "pupa":
    {
        "header": "Повесть об Ухе Панка",
        "paragraph_1": "Вселенная в тоннеле одновременно похожа и непохожа на множество других вселенных, включая нашу реальную. В ней как игровые, так и неигровые персонажи имеют свою собственную историю, характер, характеристики, внешний вид, знания и умения. Среди всех разнообразных форм жизни этого мира, лишь некоторые достойны называться разумными и именно этих рас может быть ваш персонаж:",
        "list_1": "<li>Люди</li>        <li>Литоиды</li>        <li>Дендроиды и Фунгоиды</li>        <li>Зверолюди</li>        <li>Спектралы</li>        <li>Элементали</li>        <li>Роевики</li>",
        "paragraph_2": "Помимо расы вашему персонажу надо будет выбрать особенности, среди которых есть расовые, религиозные и недостатки; одну из более 50 предысторий; навыки; а также школы магии и/или стили боя. С такими обширными возможностями кастомизации вы сможете создать как умного и таинственного мага, так и смелого харизматичного воина, так и любой другой образ из вашего сознания, даже за рамками классических РПГ типажей. А возвращаясь к магии стилям боя, вам будут доступны такие опции:",
        "list_2": "<li>Школа магии: Органика</li>   <li>Школа магии: Псионика</li>  <li>Школа магии: Элементальная (4 ветки)</li>    <li>Школа магии: Призыв</li><li>Школа магии: Геометрия</li>        <li>5 различных стилей боя</li>",
        "paragraph_3": "Поскольку мир ПУПы находится в технологическом развитии, схожем с нашей эпохой возрождения, помимо классического и экзотического холодного оружия, у вас будет возможность пользоваться арбалетами, мушкетами и другими механическими приспособлениями. Города заметно больше и сложнее, чем в средневековье, наука развивается, хоть и своим особым путем. Значительная часть этого невероятного мира уже доступна для игры:",
        "list_3": "<li>Более 60 вариантов оружия разных материалов и назначений</li>        <li>Более 35 артефактов разной степени редкости и могущественности</li>        <li>Продуманная система алхимии, ингрединетов и рецептов</li>        <li>18 накладываемых эффектов, в том числе бурный оргазм</li>        <li>СПИД, Проказа и ПТСР</li>",
        "link_1": "Первая научная история Камзонкса",
        "link_2": "Читать книгу игрока"
    },

    "project_page":
    {
        "developments": "РАЗРАБОТКИ",
        "projects": "ПРОЕКТЫ"
    },

    "shop_page":
    {
        "stickers": "СТИКЕРЫ",
        "uniform": "УНИФОРМА"
    }

}