{
    "home": {
        "projects": "Цех",
        "articles": "Бібліотека",
        "beer": "Пивоварня",
        "entertainment": "Ігрова",
        "warehouse": "Склад",
        "info": "Інформаційна дошка"
    },

    "brew": {
        "description": "Починаючи з літа 2021 року, ми займаємося варінням крафтового пива у форматі маленьких експериментальних партій. У майбутньому планується повторення вдалих рецептів та опрацювання нових рецептур. Варіння нашого пива проходить за дотримання всіх можливих технологій, але вручну і в крафтовій дачній атмосфері.",
        "amount": "На даний момент було виготовлено 3 різні сорти пива:",
        "beer_1": "Dacha blend #1 - надзвичайно легке та повітряне, з явно вираженим смаком хмелю",
        "beer_2": "Naphta - темне і щільне, досить гірке, має смак та запах із шоколадно-карамельними нотами",
        "beer_3": "Dacha blend #2 - світле фруктове пиво, нагадує індійський блідий ель",
        "technology": "Кожна партія виготовляється тиражем близько 20 пляшок об'єму 0.5 літра і фасується по пляшках з унікальною наліпкою.",
        "order": "Для замовлення або з інших питань звертатися на пошту: oko.eknm@gmail.com"
    },

    "games": {
        "server_name": "Назва серверу:",
        "server_ip": "Адресa серверу:",
        "server_version": "Версія серверу:",
        "server_mode": "Мод серверу:",
        "server_status": "Статус серверу:",
        "server_ok": "Сервер працює",
        "server_error": "Сервер недоступний"
    },

    "info": {
        "public_resources": "ПУБЛІЧНІ РЕСУРСИ",
        "feedback": "ЗВОРОТНІЙ ЗВ'ЯЗОК",
        "about": "про нас"
    },

    "library": {
        "article": "СТАТТІ",
        "read": "ЧИТАТИ"
    },

    "pokemon_article":
    {
        "header_1": "Жорстокість та Насильство у світі Покемонів:",
        "header_2": "справжня правда про вселенну, в якій панує Стокгольмський синдром та Експлуатація",
        "paragraph_1": "Всім нам відомий цей милий і барвистий світ Покемонов, але все не так яскраво як здається. Цей світ давно потонув у ненаситності та жадібності страшних чудовиськ, і я зараз говорю не про таких монстрів як Gengar, Gyarados або Mewtwo, я говорю про людей. Здавалося б, люди та дивні звірята живуть у світі, веселяться, дружать і проводять час разом, але насправді це суспільство століттями експлуатує цих нещасних та милих монстриків. Це суспільство настільки довго живе і жорстоко поневолює покемонів, що всі давно вважають це нормою.",
        "paragraph_2": "Погляньмо на цей світ по-іншому. Люди навчилися приручати Покемонов навіть до насильницького ув'язнення їх за допомогою технологій та подальшого використання в особистих цілях, ці технології називаються покеболами і вони є досить поширеними. З одного боку може здатися, що все ж таки відносини між цими істотами і так званим \"тренером\" швидше дружні, але це не зовсім так. Цілі упіймання цих істот бувають різні, починаючи від банального бажання появи вихованця, закінчуючи використанням їх для якихось виробничих цілей, наприклад: деякі істоти вміють керувати електрикою і їх використовують у різних цілях для живлення різних електричних приладів, установок і т.п. Ви тільки уявіть: бідні звірята у вигляді гвинтиків і магнітиків Magnemit-и змушені батрачити на заводах за БЕЗКОШТОВНО замість того, щоб цим займалися чоловіки або хоча б електрички (прим. фемінітив від слова електрик)",
        "paragraph_3": "Окремо варто відзначити культуру змагань та турнірів у цьому світі. Багато людей ловлять цих покемонів з метою приручення вихованця або з метою перемогти на змаганнях з ними. Цьому вчать дітей ще з раннього віку, практично будь-який школяр мріє отримати свій перший покебол, щоб насильно зловити якогось невинного Charmander-а. Багато дітей мріють вирости, зловити собі команду покемонів і піти на бої на стадіонах, борючись своїми звірятами один з одним, адже вони не просто дряпаються - вони дихають вогнем, закликають грозу, створюють каменепади і це тільки вершина айсберга того, на що здатні Покемони. Ви тільки можете собі це уявити, що б у нашому світі люди, господарі своїх звірів, збиралися на стадіонах і билися на собаках просто так, щоб дізнатися хто переможе Такса або Кане-Корсо. Це якими нелюдами треба бути, щоб своїх \"друзів\" і \"вихованців\" вести на такі муки. І ці турніри, де день і ніч діти борються між собою заради якихось дрібничок просто щоб задовольнити свій егоїзм і жагу до самореалізації, є всесвітньо обожнюваними, тисячі, а то й сотні тисяч людей і фанатів збираються подивитися як великий дракон буде битися на смерть з електричним щуром.",
        "paragraph_4": "А найжахливіше, що всі ці види спілкування зі своїм вихованцем, другом, партнером вважається нормою і подається як обопільне бажання з обох сторін. Усім чудово відомо, що кожен покемон унікальний і має свій індивідуальний характер і приклад цього послужить найвідоміший персонаж - Пікачу, який незважаючи ні на що і ні за яких обставин не хоче залазити в покебол. Глядачам намагаються показати, що тренера намагаються побудувати між ними та своїми спійманими вихованцями дружні стосунки, але тоді стає незрозумілим зміст тих покеболів, за фактом люди насильно ловлять і використовують можливості цих істот, хоча тих же цілей можна досягти аналогічним шляхом не ловлячи у покебол, а намагаючись просто приручити. Тим самим виходить, що ніби відносини заздалегідь будуються на насильницькому прирученні шляхом можливості в будь-який момент обмежити свободу істоти, що б у подальшому мати можливість використовувати по необхідності для власних цілей, будь то бажання спілкування та набуття друга, перемога в турнірах або використання у виробничих цілях. Можливо, дійсно більшості покемонів подобається бути заточеними в маленькі кульки розміром зі сливу, але в такому разі я не можу знайти жодного іншого пояснення, крім того, що у всіх покемонів за довгі роки експлуатації виробився Стокгольмський синдром.",
        "paragraph_5": "Можливо, прочитавши цю невелику статтю, ви по-іншому подивіться на світ покемонів, а краще на наш світ і на наше ставлення до наших реальних вихованців. Бережіть і любіть наших братів-менших і все ж таки спробуємо допомогти бідним звіркам з надздібностями здобути хоч крапельку свободи і прав, шляхом просування тега #СвободуПокемонамEKNM у своїх соцмережах."
    },

    "placeholder":
    {
        "example": "Далі буде..."
    },

    "project_preview":
    {
        "condition": "Статус",
        "description": "Опис",
        "page": "Сторінка"
    },

    "pupa":
    {
        "header": "Повість про Вухо Панка",
        "paragraph_1": "Всесвіт у тунелі одночасно схожий і несхожий на безліч інших всесвітів, включаючи нашу реальну. В ній як ігрові, так і неігрові персонажі мають свою власну історію, характер, характеристики, зовнішній вигляд, знання та вміння. Серед усіх різноманітних форм життя цього світу лише деякі гідні називатися розумними і саме цих рас може бути ваш персонаж:",
        "list_1": "<li>Люди</li> <li>Літоїди</li> <li>Дендроїди та Фунгоїди</li> <li>Звіролюди</li> <li>Спектрали</li> <li>Елементалі</li> <li>Ройовики</li>",
        "paragraph_2": "Крім раси вашому персонажу треба буде вибрати особливості, серед яких є расові, релігійні та вади; одну з понад 50 передісторій; навички; а також школи магії та/або стилі бою. З такими широкими можливостями кастомізації ви зможете створити як розумного і таємничого мага, так і сміливого харизматичного воїна, так і будь-який інший образ вашої свідомості, навіть за рамками класичних РПГ типажів. А повертаючись до магії стилів бою, вам будуть доступні такі опції:",
        "list_2": "<li>Школа магії: Органіка</li> <li>Школа магії: Псіоніка</li> <li>Школа магії: Елементальна (4 гілки)</li> <li>Школа магії: Весняний Призив</li><li >Школа магії: Геометрія</li> <li>5 різних стилів бою</li>",
        "paragraph_3": "Оскільки світ ПУПи знаходиться в технологічному розвитку, схожому на нашу епоху відродження, крім класичної та екзотичної холодної зброї, у вас буде можливість користуватися арбалетами, мушкетами та іншими механічними пристосуваннями. Міста помітно більші і складніші, ніж у середньовіччі, наука розвивається, хоч і своїм особливим шляхом. Значна частина цього неймовірного світу вже доступна для гри:",
        "list_3": "<li>Більше 60 варіантів зброї різних матеріалів і призначень</li> <li>Більше 35 артефактів різного ступеня рідкості та могутності</li> <li>Продумана система алхімії, інгрединетів та рецептів</li> <li>18 ефектів, що накладаються. , у тому числі бурхливий оргазм</li> <li>СНІД, Проказа та ПТСР</li>",
        "link_1": "Перша наукова історія Камзонкса",
        "link_2": "Читати книгу гравця"
    },

    "project_page":
    {
        "developments": "РОЗРОБКИ",
        "projects": "ПРОЕКТИ"
    },

    "shop_page":
    {
        "stickers": "СТИКЕРИ",
        "uniform": "УНІФОРМА"
        
    }
}