{
    "header": {
        "hub": "Хаб",
        "projects": "Цех",
        "archive": "Архів",
        "beer": "Пивоварня",
        "warehouse": "Склад"
    },

    "brew": {
        "description": "Починаючи з літа 2021 року, ми займаємося варінням крафтового пива у форматі маленьких експериментальних партій. У майбутньому планується повторення вдалих рецептів та опрацювання нових рецептур. Варіння нашого пива проходить за дотримання всіх можливих технологій, але вручну і в крафтовій дачній атмосфері.",
        "technology": "В експериментальному режимі кожна партія виготовляється тиражем близько 20 пляшок об'єму 0.5 літра і фасується по пляшках з унікальною наліпкою.",
        "order": "На час війни виробництво призупинене, будемо варити пиво в вільній країні",
        "sorts": "Сорти"
    },

    "games": {
        "server_name": "Назва серверу:",
        "server_ip": "Адресa серверу:",
        "server_version": "Версія серверу:",
        "server_mode": "Мод серверу:",
        "server_status": "Статус серверу:",
        "server_ok": "Сервер працює",
        "server_error": "Сервер недоступний"
    },

    "library": {
        "article": "СТАТТІ",
        "read": "ЧИТАТИ"
    },

    "placeholder": {
        "example": "Далі буде..."
    },

    "project_preview": {
        "page": "Детальніше"
    },

    "project_page": {
        "status": "Статус:",
        "developments": "РОЗРОБКИ",
        "projects": "ПРОЕКТИ"
    },

    "shop_page": {
        "stickers": "СТИКЕРИ",
        "uniform": "УНІФОРМА"
    },

    "landing": {
        "main_title": "ЛАСКАВО ПРОСИМО НА ЗАВОД",
        "dev_title": "РОЗРОБКИ",
        "dev_text": "Ми створюємо машини для вирішення стандартних завдань та займаємося розвагою. Такі справи, розумієш? Обертаємо цивілізацію, подобається тобі це чи ні. Ти це пам'ятай і давай більше не будемо про це. Ми дорослі люди і точно не маємо права забути про людські слабкості.",
        "dev_button": "ВІДВІДАТИ МАЙСТЕРНЮ →",
        "wh_title": "ЗАВОД",
        "wh_text": "На заводських складах лежать дивні речі. Окрім спирту – кров. Про інші наркотики тільки чутки ходять, але про це точно все відомо. Причому не лише нашому заводу, а й міліції, до якої надійшла інформація. Навіть два орієнтовні списки показали, де цих речовин може бути більше. Але конкретних імен поки що немає.",
        "wh_button": "ВІДВІДАТИ СКЛАД →",
        "lib_title": "ЖУРНАЛІСТИКА",
        "lib_text": "У наших статтях проявляється цинізм та невігластво у більшості питань. І причина не в нестачі часу чи обмеженості, а в тому, що більшість авторів не читали серйозних книг. Ми вважаємо, що чесно проясняємо підняті в них проблеми.",
        "lib_button": "ВІДВІДАТИ БІБЛІОТЕКУ →",
        "brew_title": "ПИВО",
        "brew_text": "У нашій пивоварні відбувається процес, зворотній до того, що голова кращої мережі розливу пива в нашому регіоні, знає найкраще. Скасовуються заздалегідь призначені зустрічі, якісь, навпаки, призначаються, але пиво з підвального приміщення кудись зникає.",
        "brew_button": "ВІДВІДАТИ ПИВОВАРНЮ →",
        "also_visit": "ТАКОЖ ВІДВІДАЙТЕ"
    }
}
