{
    "home": {
        "projects": "Цех",
        "articles": "Бібліотека",
        "beer": "Пивоварня",
        "entertainment": "Ігрова",
        "warehouse": "Склад",
        "info": "Інформаційна дошка"
    },

    "brew": {
        "description": "Починаючи з літа 2021 року, ми займаємося варінням крафтового пива у форматі маленьких експериментальних партій. У майбутньому планується повторення вдалих рецептів та опрацювання нових рецептур. Варіння нашого пива проходить за дотримання всіх можливих технологій, але вручну і в крафтовій дачній атмосфері.",
        "technology": "В експериментальному режимі кожна партія виготовляється тиражем близько 20 пляшок об'єму 0.5 літра і фасується по пляшках з унікальною наліпкою.",
        "order": "На час війни виробництво заморожене, будемо варити пиво в вільній країні",
        "sorts": "Сорти"
    },

    "games": {
        "server_name": "Назва серверу:",
        "server_ip": "Адресa серверу:",
        "server_version": "Версія серверу:",
        "server_mode": "Мод серверу:",
        "server_status": "Статус серверу:",
        "server_ok": "Сервер працює",
        "server_error": "Сервер недоступний"
    },

    "info": {
        "public_resources": "ПУБЛІЧНІ РЕСУРСИ",
        "feedback": "ЗВОРОТНІЙ ЗВ'ЯЗОК",
        "about": "про нас",
        "question1": "- Що таке EKNM?",
        "answer1": "Організація, компанія, секта, бренд, корпорація, синдікат, колискова, просто набір букв. Выберить те, що вам більше подобається.",
        "question2": "- У чому ціль EKNM?",
        "answer2": "Створення і подтримка ініціатив, проектів та розробок в сфері науки, мистецтва та бізнесу. Можливо щось ще.",
        "question3": "- А навіщо?",
        "answer3": "Часи одиночної праці пройшли и такий підхід безнадійно застарів. Спільна праця більш ефективна і дозволяє задіяти більше знань, ресурсів та різносторонніх поглядів. Ми живемо в епоху заводів.",
        "question4": "- Як допомогти або приєднатись?",
        "answer4": "Звернутись за контактами на цій сторінці і описати що ви можете запропонувати або чим ми можемо вам допомогти. В ідеалі ви маєте бути знайомими з кимось з нас, але це не обовʼязково.",
        "question5": "- Чим EKNM зацікавлений на данний момент?",
        "answer5": "Розробки, статті і проекти будь-якого типу, які містять у себі щось інноваціонне та/або мистецьку цінність. Більш чітки рамки не мають сенсу."
    },

    "library": {
        "article": "СТАТТІ",
        "read": "ЧИТАТИ"
    },

    "placeholder": {
        "example": "Далі буде..."
    },

    "project_preview": {
        "page": "Детальніше"
    },

    "project_page": {
        "developments": "РОЗРОБКИ",
        "projects": "ПРОЕКТИ"
    },

    "shop_page": {
        "stickers": "СТИКЕРИ",
        "uniform": "УНІФОРМА"
    }
}
