import { Component, OnInit } from '@angular/core';
import { Router } from '@angular/router';

@Component({
    selector: 'app-landing-page',
    templateUrl: './landing-page.component.html',
    styleUrls: ['./landing-page.component.css'],
})
export class LandingPageComponent implements OnInit {
    mainText: string = '';
    currentLanguage = '';

    constructor(private router: Router) {
        this.updateHeaderText();
    }

    ngOnInit(): void {}

    updateHeaderText() {
        var texts = [
            'це організація, яка кидає студентам-першокурсникам до рук їх скромний щоденник! Знаете, чим це закінчується? Террором! И уявіть – секретність! Тому що від страху лишаються лиш мікроскопічні сліди на язиці, імена учасників і розклад занять.',
            'це организація, яка оголошує про наміри здійснити неможливе і одночасно в корні змінити світ! Тепер уявіть, що після першого поштовху в історії з глобальною фінансовою аферою зʼявляється версія про те, що кінцевою ціллю всіх цих маніпуляцій є повний кінець історії. Уявіть, що тоді станеться.',
            'це компанія, яка підтримує добровольців накшталт тебе! В своїх ідіотських нотах ми зачатками твого таланта вже все зʼясували, а уж далі… Ех, я не знаю, в нас взагалі ніяких інакодумців немає.',
            'схожа на секту, але ніякої секти там немає. Ми просто еклектичне обʼєднання магів, ну і разом з тим альтернативний суспільству орган, планомірно сприяючий виходу України з індустріальної кризи. Ви абсолютно правильно сказали – держава була б сильнішою від такої конформістсько-кастової системи...',
            'має мету бути ідеальною абстракцією, що повністю ігнорує фундаментальні особливості людської психіки. Вона дозволяє нам міркувати про цей таємничий світ із майже містичною легкістю. Справа в тому, що ми не здатні побачити концепцію як таку.',
            'має на меті розділити сприйняття на послідовність безпосереднього та опосередкованого досвіду. Першою є сама подія. Під час першого виходу по каналу смерті кожен з наших дітей отримає від Бога нематеріальну допомогу.',
        ];
        let textIndex = Math.floor(Math.random() * texts.length);
        this.mainText = texts[textIndex];
    }

    navigate(path: string) {
        this.router.navigate([path]);
    }
}
